MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0CAC18R/mcu.h
#define DMAMUX_CHCFG0                 (*((volatile uint32_t *)0x40021000))      // Channel Configuration register
#define DMAMUX_CHCFG1                 (*((volatile uint32_t *)0x40021001))      // Channel Configuration register
#define DMAMUX_CHCFG2                 (*((volatile uint32_t *)0x40021002))      // Channel Configuration register
#define DMAMUX_CHCFG3                 (*((volatile uint32_t *)0x40021003))      // Channel Configuration register
#define DMAMUX_CHCFG4                 (*((volatile uint32_t *)0x40021004))      // Channel Configuration register
#define DMAMUX_CHCFG5                 (*((volatile uint32_t *)0x40021005))      // Channel Configuration register
#define DMAMUX_CHCFG6                 (*((volatile uint32_t *)0x40021006))      // Channel Configuration register
#define DMAMUX_CHCFG7                 (*((volatile uint32_t *)0x40021007))      // Channel Configuration register
#define DMAMUX_CHCFG8                 (*((volatile uint32_t *)0x40021008))      // Channel Configuration register
#define DMAMUX_CHCFG9                 (*((volatile uint32_t *)0x40021009))      // Channel Configuration register
#define DMAMUX_CHCFG10                (*((volatile uint32_t *)0x4002100A))      // Channel Configuration register
#define DMAMUX_CHCFG11                (*((volatile uint32_t *)0x4002100B))      // Channel Configuration register
#define DMAMUX_CHCFG12                (*((volatile uint32_t *)0x4002100C))      // Channel Configuration register
#define DMAMUX_CHCFG13                (*((volatile uint32_t *)0x4002100D))      // Channel Configuration register
#define DMAMUX_CHCFG14                (*((volatile uint32_t *)0x4002100E))      // Channel Configuration register
#define DMAMUX_CHCFG15                (*((volatile uint32_t *)0x4002100F))      // Channel Configuration register
#define DMAMUX_CHCFG16                (*((volatile uint32_t *)0x40021010))      // Channel Configuration register
#define DMAMUX_CHCFG17                (*((volatile uint32_t *)0x40021011))      // Channel Configuration register
#define DMAMUX_CHCFG18                (*((volatile uint32_t *)0x40021012))      // Channel Configuration register
#define DMAMUX_CHCFG19                (*((volatile uint32_t *)0x40021013))      // Channel Configuration register
#define DMAMUX_CHCFG20                (*((volatile uint32_t *)0x40021014))      // Channel Configuration register
#define DMAMUX_CHCFG21                (*((volatile uint32_t *)0x40021015))      // Channel Configuration register
#define DMAMUX_CHCFG22                (*((volatile uint32_t *)0x40021016))      // Channel Configuration register
#define DMAMUX_CHCFG23                (*((volatile uint32_t *)0x40021017))      // Channel Configuration register
#define DMAMUX_CHCFG24                (*((volatile uint32_t *)0x40021018))      // Channel Configuration register
#define DMAMUX_CHCFG25                (*((volatile uint32_t *)0x40021019))      // Channel Configuration register
#define DMAMUX_CHCFG26                (*((volatile uint32_t *)0x4002101A))      // Channel Configuration register
#define DMAMUX_CHCFG27                (*((volatile uint32_t *)0x4002101B))      // Channel Configuration register
#define DMAMUX_CHCFG28                (*((volatile uint32_t *)0x4002101C))      // Channel Configuration register
#define DMAMUX_CHCFG29                (*((volatile uint32_t *)0x4002101D))      // Channel Configuration register
#define DMAMUX_CHCFG30                (*((volatile uint32_t *)0x4002101E))      // Channel Configuration register
#define DMAMUX_CHCFG31                (*((volatile uint32_t *)0x4002101F))      // Channel Configuration register


//*****************************************************************************
//
// Enhanced Direct Memory Access (eDMA) registers
//
//*****************************************************************************

#define DMA_CR                        (*((volatile uint32_t *)0x40008000))      // Control Register
#define DMA_ES                        (*((volatile uint32_t *)0x40008004))      // Error Status Register
#define DMA_ERQ                       (*((volatile uint32_t *)0x4000800C))      // Enable Request Register
#define DMA_EEI                       (*((volatile uint32_t *)0x40008014))      // Enable Error Interrupt Register
#define DMA_CEEI                      (*((volatile uint32_t *)0x40008018))      // Clear Enable Error Interrupt Register
#define DMA_SEEI                      (*((volatile uint32_t *)0x40008019))      // Set Enable Error Interrupt Register


//*****************************************************************************
//
// External Watchdog Monitor (EWM) registers
//
//*****************************************************************************

#define EWM_CTRL                      (*((volatile uint32_t *)0x40061000))      // Control Register (EWM_CTRL)
#define EWM_SERV                      (*((volatile uint32_t *)0x40061001))      // Service Register (EWM_SERV)
#define EWM_CMPL                      (*((volatile uint32_t *)0x40061002))      // Compare Low Register (EWM_CMPL)
#define EWM_CMPH                      (*((volatile uint32_t *)0x40061003))      // Compare High Register (EWM_CMPH)


//*****************************************************************************
//
// Watchdog Timer (WDOG) registers
//
//*****************************************************************************

#define WDOG_STCTRLH                  (*((volatile uint32_t *)0x40052000))      // Watchdog Status and Control Register High
#define WDOG_STCTRLL                  (*((volatile uint32_t *)0x40052002))      // Watchdog Status and Control Register Low
#define WDOG_TOVALH                   (*((volatile uint32_t *)0x40052004))      // Watchdog Time-out Value Register High
#define WDOG_TOVALL                   (*((volatile uint32_t *)0x40052006))      // Watchdog Time-out Value Register Low
#define WDOG_WINH                     (*((volatile uint32_t *)0x40052008))      // Watchdog Window Register High
#define WDOG_WINL                     (*((volatile uint32_t *)0x4005200A))      // Watchdog Window Register Low
#define WDOG_REFRESH                  (*((volatile uint32_t *)0x4005200C))      // Watchdog Refresh register
#define WDOG_UNLOCK                   (*((volatile uint32_t *)0x4005200E))      // Watchdog Unlock register
#define WDOG_TMROUTH                  (*((volatile uint32_t *)0x40052010))      // Watchdog Timer Output Register High
#define WDOG_TMROUTL                  (*((volatile uint32_t *)0x40052012))      // Watchdog Timer Output Register Low
#define WDOG_RSTCNT                   (*((volatile uint32_t *)0x40052014))      // Watchdog Reset Count register
#define WDOG_PRESC                    (*((volatile uint32_t *)0x40052016))      // Watchdog Prescaler register


//*****************************************************************************
//
// Multipurpose Clock Generator (MCG) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control 1 Register (MCG_C1)
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control 2 Register (MCG_C2)
#define MCG_C3                        (*((volatile uint32_t *)0x40064002))      // MCG Control 3 Register (MCG_C3)
#define MCG_C4                        (*((volatile uint32_t *)0x40064003))      // MCG Control 4 Register (MCG_C4)
#define MCG_C5                        (*((volatile uint32_t *)0x40064004))      // MCG Control 5 Register (MCG_C5)
#define MCG_C6                        (*((volatile uint32_t *)0x40064005))      // MCG Control 6 Register (MCG_C6)
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register (MCG_S)
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register (MCG_SC)
#define MCG_ATCVH                     (*((volatile uint32_t *)0x4006400A))      // MCG Auto Trim Compare Value High Register (MCG_ATCVH)
#define MCG_ATCVL                     (*((volatile uint32_t *)0x4006400B))      // MCG Auto Trim Compare Value Low Register (MCG_ATCVL)
#define MCG_C7                        (*((volatile uint32_t *)0x4006400C))      // MCG Control 7 Register (MCG_C7)
#define MCG_C8                        (*((volatile uint32_t *)0x4006400D))      // MCG Control 8 Register (MCG_C8)
#define MCG_C9                        (*((volatile uint32_t *)0x4006400E))      // MCG Control 9 Register (MCG_C9)
#define MCG_C11                       (*((volatile uint32_t *)0x40064010))      // MCG Control 11 Register (MCG_C11)
#define MCG_C12                       (*((volatile uint32_t *)0x40064011))      // MCG Control 12 Register (MCG_C12)
#define MCG_S2                        (*((volatile uint32_t *)0x40064012))      // MCG Status 2 Register (MCG_S2)
#define MCG_T3                        (*((volatile uint32_t *)0x40064013))      // MCG Test 3 Register (MCG_T3)


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC_CR                        (*((volatile uint32_t *)0x40065000))      // OSC Control Register
#define OSC_OSC_DIV                   (*((volatile uint32_t *)0x40065002))      // OSC CLock divider register


//*****************************************************************************
//
// Flash Memory Controller (FMC) registers
//
//*****************************************************************************

#define FMC_PFAPR                     (*((volatile uint32_t *)0x0))      // Flash Access Protection Register
#define FMC_PFB01CR                   (*((volatile uint32_t *)0x4))      // Flash Bank 0-1 Control Register
#define FMC_PFB23CR                   (*((volatile uint32_t *)0x8))      // Flash Bank 2-3 Control Register
#define FMC_TAGVDW0S0                 (*((volatile uint32_t *)0x100))      // Cache Tag Storage
#define FMC_TAGVDW0S1                 (*((volatile uint32_t *)0x104))      // Cache Tag Storage
#define FMC_TAGVDW0S2                 (*((volatile uint32_t *)0x108))      // Cache Tag Storage
#define FMC_TAGVDW0S3                 (*((volatile uint32_t *)0x10C))      // Cache Tag Storage
#define FMC_TAGVDW1S0                 (*((volatile uint32_t *)0x110))      // Cache Tag Storage
#define FMC_TAGVDW1S1                 (*((volatile uint32_t *)0x114))      // Cache Tag Storage
#define FMC_TAGVDW1S2                 (*((volatile uint32_t *)0x118))      // Cache Tag Storage
#define FMC_TAGVDW1S3                 (*((volatile uint32_t *)0x11C))      // Cache Tag Storage
#define FMC_TAGVDW2S0                 (*((volatile uint32_t *)0x120))      // Cache Tag Storage
#define FMC_TAGVDW2S1                 (*((volatile uint32_t *)0x124))      // Cache Tag Storage
#define FMC_TAGVDW2S2                 (*((volatile uint32_t *)0x128))      // Cache Tag Storage
#define FMC_TAGVDW2S3                 (*((volatile uint32_t *)0x12C))      // Cache Tag Storage
#define FMC_TAGVDW3S0                 (*((volatile uint32_t *)0x130))      // Cache Tag Storage
#define FMC_TAGVDW3S1                 (*((volatile uint32_t *)0x134))      // Cache Tag Storage
#define FMC_TAGVDW3S2                 (*((volatile uint32_t *)0x138))      // Cache Tag Storage
#define FMC_TAGVDW3S3                 (*((volatile uint32_t *)0x13C))      // Cache Tag Storage
#define FMC_DATAW0S0UM                (*((volatile uint32_t *)0x200))      // Cache Data Storage
#define FMC_DATAW0S0MU                (*((volatile uint32_t *)0x204))      // Cache Data Storage
#define FMC_DATAW0S0ML                (*((volatile uint32_t *)0x208))      // Cache Data Storage
#define FMC_DATAW0S0LM                (*((volatile uint32_t *)0x20C))      // Cache Data Storage
#define FMC_DATAW0S1UM                (*((volatile uint32_t *)0x210))      // Cache Data Storage
#define FMC_DATAW0S1MU                (*((volatile uint32_t *)0x214))      // Cache Data Storage
#define FMC_DATAW0S1ML                (*((volatile uint32_t *)0x218))      // Cache Data Storage
#define FMC_DATAW0S1LM                (*((volatile uint32_t *)0x21C))      // Cache Data Storage
#define FMC_DATAW0S2UM                (*((volatile uint32_t *)0x220))      // Cache Data Storage
#define FMC_DATAW0S2MU                (*((volatile uint32_t *)0x224))      // Cache Data Storage


//*****************************************************************************
//
// External Bus Interface (FlexBus) registers
//
//*****************************************************************************

#define FB_CSAR0                      (*((volatile uint32_t *)0x4000C000))      // Chip Select Address Register (FB_CSAR0)
#define FB_CSMR0                      (*((volatile uint32_t *)0x4000C004))      // Chip Select Mask Register (FB_CSMR0)
#define FB_CSCR0                      (*((volatile uint32_t *)0x4000C008))      // Chip Select Control Register (FB_CSCR0)
#define FB_CSAR1                      (*((volatile uint32_t *)0x4000C00C))      // Chip Select Address Register (FB_CSAR1)
#define FB_CSMR1                      (*((volatile uint32_t *)0x4000C010))      // Chip Select Mask Register (FB_CSMR1)
#define FB_CSCR1                      (*((volatile uint32_t *)0x4000C014))      // Chip Select Control Register (FB_CSCR1)
#define FB_CSAR2                      (*((volatile uint32_t *)0x4000C018))      // Chip Select Address Register (FB_CSAR2)
#define FB_CSMR2                      (*((volatile uint32_t *)0x4000C01C))      // Chip Select Mask Register (FB_CSMR2)
#define FB_CSCR2                      (*((volatile uint32_t *)0x4000C020))      // Chip Select Control Register (FB_CSCR2)
#define FB_CSAR3                      (*((volatile uint32_t *)0x4000C024))      // Chip Select Address Register (FB_CSAR3)
#define FB_CSMR3                      (*((volatile uint32_t *)0x4000C028))      // Chip Select Mask Register (FB_CSMR3)
#define FB_CSCR3                      (*((volatile uint32_t *)0x4000C02C))      // Chip Select Control Register (FB_CSCR3)
#define FB_CSAR4                      (*((volatile uint32_t *)0x4000C030))      // Chip Select Address Register (FB_CSAR4)
#define FB_CSMR4                      (*((volatile uint32_t *)0x4000C034))      // Chip Select Mask Register (FB_CSMR4)
#define FB_CSCR4                      (*((volatile uint32_t *)0x4000C038))      // Chip Select Control Register (FB_CSCR4)
#define FB_CSAR5                      (*((volatile uint32_t *)0x4000C03C))      // Chip Select Address Register (FB_CSAR5)
#define FB_CSMR5                      (*((volatile uint32_t *)0x4000C040))      // Chip Select Mask Register (FB_CSMR5)
#define FB_CSCR5                      (*((volatile uint32_t *)0x4000C044))      // Chip Select Control Register (FB_CSCR5)
#define FB_CSPMCR                     (*((volatile uint32_t *)0x4000C060))      // Chip Select port Multiplexing Control Register (FB_CSPMCR)


//*****************************************************************************
//
// Synchronous DRAM Controller Module (SDRAM) registers
//
//*****************************************************************************

#define SDRAM_CTRL                    (*((volatile uint32_t *)0x4000F042))      // Control Register
#define SDRAM_AC0                     (*((volatile uint32_t *)0x4000F048))      // Address and Control Register
#define SDRAM_CM0                     (*((volatile uint32_t *)0x4000F04C))      // Control Mask
#define SDRAM_AC1                     (*((volatile uint32_t *)0x4000F050))      // Address and Control Register
#define SDRAM_CM1                     (*((volatile uint32_t *)0x4000F054))      // Control Mask


//*****************************************************************************
//
// Cyclic Redundancy Check (CRC) registers
//
//*****************************************************************************

#define CRC_DATA                      (*((volatile uint32_t *)0x40032000))      // CRC Data register
#define CRC_GPOLY                     (*((volatile uint32_t *)0x40032004))      // CRC Polynomial register
#define CRC_CTRL                      (*((volatile uint32_t *)0x40032008))      // CRC Control register


//*****************************************************************************
//
// Cryptographic Acceleration Unit (CAU) registers
//
//*****************************************************************************

#define CAU_CASR                      (*((volatile uint32_t *)0xE0081000))      // Status Register
#define CAU_CAA                       (*((volatile uint32_t *)0xE0081001))      // Accumulator


//*****************************************************************************
//
// Random Number Generator Accelerator (RNGA) registers
//
//*****************************************************************************

