MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0CAC18R/mcu.h
#define DACEN                         0x00000080      // Starts the Programmable Reference Generator operation.
#define DACRFS                        0x00000040      // The DAC selects DACREF_1 as the reference voltage.
#define DACTRGSEL                     0x00000020      // The DAC hardware trigger is selected.
#define DACSWTRG                      0x00000010      // Active high. This is a write-only field, which always reads 0. If DAC software trigger is selected and buffer is enabled, writing 1 to this field will advance the buffer read pointer once.
#define LPEN                          0x00000008      // High-Power mode
#define DACBWIEN                      0x00000004      // The DAC buffer watermark interrupt is disabled.
#define DACBTIEN                      0x00000002      // The DAC buffer read pointer top flag interrupt is disabled.
#define DACBBIEN                      0x00000001      // The DAC buffer read pointer bottom flag interrupt is disabled.


//*****************************************************************************
//
// The following are defines for the bit fields in the DACx_C1 register.
//
//*****************************************************************************

#define DMAEN                         0x00000080      // DMA is disabled.
#define DACBFWM                       0x00000030      // Controls when SR[DACBFWMF] is set. When the DAC buffer read pointer reaches the word defined by this field, which is 1–4 words away from the upper limit (DACBUP), SR[DACBFWMF] will be set. This allows user configuration of the watermark interrupt.
#define DACBFMD                       0x0000000C      // Normal mode
#define DACBFEN                       0x00000001      // Buffer read pointer is disabled. The converted data is always the first word of the buffer.


//*****************************************************************************
//
// The following are defines for the bit fields in the DACx_C2 register.
//
//*****************************************************************************

#define DACBFRP                       0x00000780      // Keeps the current value of the buffer read pointer.
#define DACBFUP                       0x00000078      // Selects the upper limit of the DAC buffer. The buffer read pointer cannot exceed it.


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_SC register.
//
//*****************************************************************************

#define VREFEN                        0x00000080      // Internal Voltage Reference enable
#define REGEN                         0x00000040      // Regulator enable
#define ICOMPEN                       0x00000020      // Second order curvature compensation enable
#define VREFST                        0x00000004      // VREF status
#define MODE_LV                       0x00000002      // Buffer mode select ::


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_SC register.
//
//*****************************************************************************

#define DMA                           0x00000100      // DMA Enable
#define TOF                           0x00000080      // Timer Overflow Flag
#define TOIE                          0x00000040      // Timer Overflow Interrupt Enable
#define CPWMS                         0x00000020      // Center-Aligned PWM Select
#define CMOD                          0x00000030      // Clock Mode Selection
#define PS                            0x0000001C      // Prescale Factor Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CNT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Counter value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_MOD register.
//
//*****************************************************************************

#define MOD                           0x7FFF8000      // Modulo value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CnSC register.
//
//*****************************************************************************

#define CHF                           0x00000080      // Channel Flag
#define CHIE                          0x00000040      // Channel Interrupt Enable
#define MSB                           0x00000020      // Channel Mode Select
#define MSA                           0x00000010      // Channel Mode Select
#define ELSB:ELSA                     0x00000018      // Edge or Level Select
#define DMA                           0x00000001      // DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CnV register.
//
//*****************************************************************************

#define VAL                           0x7FFF8000      // Channel Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_STATUS register.
//
//*****************************************************************************

#define TOF                           0x00000100      // Timer Overflow Flag
#define CH1F                          0x00000002      // Channel 1 Flag
#define CH0F                          0x00000001      // Channel 0 Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_COMBINE register.
//
//*****************************************************************************

#define COMSWAP0                      0x00000002      // Combine Channel 0 and 1 Swap
#define COMBINE0                      0x00000001      // Combine Channels 0 and 1


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_POL register.
//
//*****************************************************************************

