MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0CAC18R/mcu.h
#define JSTATE                        0x00000080      // Live USB differential receiver JSTATE signal
#define SE0                           0x00000040      // Live USB Single Ended Zero signal
#define TXSUSPENDTOKENBUSY            0x00000020      // In Host mode, TOKEN_BUSY is set when the USB module is busy executing a USB token
#define RESET                         0x00000010      // Setting this bit enables the USB Module to generate USB reset signaling
#define HOSTMODEEN                    0x00000008      // When set to 1, this bit enables the USB Module to operate in Host mode
#define RESUME                        0x00000004      // When set to 1 this bit enables the USB Module to execute resume signaling
#define ODDRST                        0x00000002      // Setting this bit to 1 resets all the BDT ODD ping/pong fields to 0, which then specifies the EVEN BDT bank
#define USBENSOFEN                    0x00000001      // USB Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDR register.
//
//*****************************************************************************

#define LSEN                          0x00000080      // Low Speed Enable bit
#define ADDR                          0x00001FC0      // USB Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE1 register.
//
//*****************************************************************************

#define BDTBA                         0x00003F80      // Provides address bits 15 through 9 of the BDT base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUML register.
//
//*****************************************************************************

#define FRM[7:0]                      0x00007F80      // This 8-bit field and the 3-bit field in the Frame Number Register High are used to compute the address where the current Buffer Descriptor Table (BDT) resides in system memory


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUMH register.
//
//*****************************************************************************

#define FRM[10:8]                     0x0000001C      // This 3-bit field and the 8-bit field in the Frame Number Register Low are used to compute the address where the current Buffer Descriptor Table (BDT) resides in system memory


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_TOKEN register.
//
//*****************************************************************************

#define TOKENPID                      0x00000780      // Contains the token type executed by the USB module
#define TOKENENDPT                    0x00000078      // Holds the Endpoint address for the token command


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_SOFTHLD register.
//
//*****************************************************************************

#define CNT                           0x07FFE000      // Represents the SOF count threshold in byte times


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE2 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // Provides address bits 23 through 16 of the BDT base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE3 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // Provides address bits 31 through 24 of the BDT base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ENDPTn register.
//
//*****************************************************************************

#define HOSTWOHUB                     0x00000080      // Host without a hub
#define RETRYDIS                      0x00000040      // This is a Host mode only bit and is present in the control register for endpoint 0 (ENDPT0) only
#define EPCTLDIS                      0x00000010      // This bit, when set, disables control (SETUP) transfers
#define EPRXEN                        0x00000008      // This bit, when set, enables the endpoint for RX transfers
#define EPTXEN                        0x00000004      // This bit, when set, enables the endpoint for TX transfers
#define EPSTALL                       0x00000002      // When set this bit indicates that the endpoint is called
#define EPHSHK                        0x00000001      // When set this bit enables an endpoint to perform handshaking during a transaction to this endpoint


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBCTRL register.
//
//*****************************************************************************

#define SUSP                          0x00000080      // Places the USB transceiver into the suspend state
#define PDE                           0x00000040      // Enables the weak pulldowns on the USB transceiver


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OBSERVE register.
//
//*****************************************************************************

#define DPPU                          0x00000080      // Provides observability of the D+ Pullup enable at the USB transceiver
#define DPPD                          0x00000040      // Provides observability of the D+ Pulldown enable at the USB transceiver
#define DMPD                          0x00000010      // Provides observability of the D- Pulldown enable at the USB transceiver


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CONTROL register.
//
//*****************************************************************************

#define DPPULLUPNONOTG                0x00000010      // Provides control of the DP Pullup in USBOTG, if USB is configured in non-OTG device mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBTRC0 register.
//
//*****************************************************************************

#define USBRESET                      0x00000080      // Generates a hard reset to USBOTG
#define USBRESMEN                     0x00000020      // Asynchronous Resume Interrupt Enable
#define USB_CLK_RECOVERY_INT          0x00000004      // Combined USB Clock Recovery interrupt status
#define SYNC_DET                      0x00000002      // Synchronous USB Interrupt Detect
#define USB_RESUME_INT                0x00000001      // USB Asynchronous Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBFRMADJUST register.
//
//*****************************************************************************

#define ADJ                           0x00007F80      // Frame Adjustment


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_CTRL register.
//
//*****************************************************************************

#define CLOCK_RECOVER_EN              0x00000080      // Crystal-less USB enable
#define RESET_ROUGH_EN                0x00000040      // Reset/resume to rough phase enable
#define RESTART_IFRTRIM_EN            0x00000020      // Restart from IFR trim value


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_IRC_EN register.
//
//*****************************************************************************

#define IRC_EN                        0x00000002      // IRC48M enable
#define REG_EN                        0x00000001      // IRC48M regulator enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_INT_EN register.
//
//*****************************************************************************

