MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0CAC18R/mcu.h
#define PLL_LOCK                      0x80000000      // USB PLL lock status indicator
#define PLL_BYPASS                    0x00010000      // Bypass the USB PLL
#define PLL_ENABLE                    0x00002000      // Enable the clock output from the USB PLL
#define PLL_POWER                     0x00001000      // Power up the USB PLL
#define PLL_EN_USB_CLKS               0x00000040      // Enable the USB clock output from the USB PHY PLL
#define PLL_DIV_SEL                   0x00000070      // This field controls the USB PLL feedback loop divider


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_VBUS_DETECTn register.
//
//*****************************************************************************

#define EN_CHARGER_RESISTOR           0x80000000      // Enables resistors used for an older method of resistive battery charger detection
#define DISCHARGE_VBUS                0x04000000      // Controls VBUS discharge resistor
#define PWRUP_CMPS                    0x00C00000      // Enables the VBUS_VALID comparator
#define VBUSVALID_TO_SESSVALID        0x00040000      // Selects the comparator used for VBUS_VALID
#define VBUS_SOURCE_SEL               0x00000C00      // Selects the source of the VBUS_VALID signal reported to the USB controller
#define VBUSVALID_SEL                 0x00000100      // Selects the source of the VBUS_VALID signal reported to the USB controller
#define VBUSVALID_OVERRIDE            0x00000080      // Override value for VBUS_VALID signal sent to USB controller
#define AVALID_OVERRIDE               0x00000040      // Override value for A-Device Session Valid
#define BVALID_OVERRIDE               0x00000020      // Override value for B-Device Session Valid
#define SESSEND_OVERRIDE              0x00000010      // Override value for SESSEND
#define VBUS_OVERRIDE_EN              0x00000008      // VBUS detect signal override enable
#define VBUSVALID_THRESH              0x0000001C      // Sets the threshold for the VBUSVALID comparator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_VBUS_DET_STAT register.
//
//*****************************************************************************

#define VBUS_VALID_3V                 0x00000010      // VBUS_VALID_3V detector status
#define VBUS_VALID                    0x00000008      // VBUS voltage status
#define AVALID                        0x00000004      // A-Device Session Valid status
#define BVALID                        0x00000002      // B-Device Session Valid status
#define SESSEND                       0x00000001      // Session End indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_CHRG_DET_STAT register.
//
//*****************************************************************************

#define SECDET_DCP                    0x00000010      // Battery Charging Secondary Detection phase output
#define DP_STATE                      0x00000008      // Single ended receiver output for the USB_DP pin, from charger detection circuits
#define DM_STATE                      0x00000004      // Single ended receiver output for the USB_DM pin, from charger detection circuits
#define CHRG_DETECTED                 0x00000002      // Battery Charging Primary Detection phase output
#define PLUG_CONTACT                  0x00000001      // Battery Charging Data Contact Detection phase output


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_ANACTRLn register.
//
//*****************************************************************************

#define EMPH_CUR_CTRL                 0x00018000      // Controls the amount of pre-emphasis current added for the High-Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1'b1
#define EMPH_EN                       0x00002000      // Enables pre-emphasis for the High-Speed TX drivers
#define EMPH_PULSE_CTRL               0x00003000      // Controls pre-emphasis time duration for the High Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1'b1
#define DEV_PULLDOWN                  0x00000400      // Setting this field to 1'b1 will enable the 15kΩ pulldown resistors on both USB_DP and USB_DM pins
#define PFD_FRAC                      0x00007E00      // PFD fractional divider setting used to select the pfd_clk output frequency
#define PFD_CLK_SEL                   0x00000018      // This bit field for the PFD selects the frequency relationship between the local pfd_clk output and the exported USB1PFDCLK
#define PFD_CLKGATE                   0x00000002      // This bit field controls clock gating (disabling) for the PFD pfd_clk output for power savings when the PFD is not used
#define TESTCLK_SEL                   0x00000001      // Test clock selection to analog test


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_LOOPBACKn register.
//
//*****************************************************************************

#define TSTPKT                        0x7F800000      // Selects the packet data byte used for USB loopback testing in Pulse mode
#define TSTI_HSFS_MODE_EN             0x00008000      // Setting this bit field to value 1'b1 will enable the loopback test to dynamically change the packet speed
#define UTMO_DIG_TST1                 0x00000100      // Mode control for USB loopback test
#define UTMO_DIG_TST0                 0x00000080      // Mode control for USB loopback test
#define TSTI_TX_HIZ                   0x00000040      // Sets TX Hi-Z for USB loopback test
#define TSTI_TX_EN                    0x00000020      // Enable TX for USB loopback test
#define TSTI_TX_LS_MODE               0x00000010      // Set to value 1'b1 to choose LS for USB loopback testing, set to value 1'b0 to choose HS or FS mode
#define TSTI_TX_HS_MODE               0x00000008      // Select HS or FS mode for USB loopback testing
#define UTMI_TESTSTART                0x00000001      // This bit enables the USB loopback test ::


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_LOOPBACK_HSFSCNTn register.
//
//*****************************************************************************

