MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0CAC18R/mcu.h
#define TDR                           0x00000001      // Transmit Data Register


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TFRn register.
//
//*****************************************************************************

#define WCP                           0x80000000      // Write Channel Pointer
#define WFP                           0x00780000      // Write FIFO Pointer
#define RFP                           0x00000001      // Read FIFO Pointer


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TMR register.
//
//*****************************************************************************

#define TWM                           0x00000001      // Transmit Word Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCSR register.
//
//*****************************************************************************

#define RE                            0x80000000      // Receiver Enable
#define STOPE                         0x40000000      // Stop Enable
#define DBGE                          0x20000000      // Debug Enable
#define BCE                           0x10000000      // Bit Clock Enable
#define FR                            0x02000000      // FIFO Reset
#define SR                            0x01000000      // Software Reset
#define WSF                           0x00100000      // Word Start Flag
#define SEF                           0x00080000      // Sync Error Flag
#define FEF                           0x00040000      // FIFO Error Flag
#define FWF                           0x00020000      // FIFO Warning Flag
#define FRF                           0x00010000      // FIFO Request Flag
#define WSIE                          0x00001000      // Word Start Interrupt Enable
#define SEIE                          0x00000800      // Sync Error Interrupt Enable
#define FEIE                          0x00000400      // FIFO Error Interrupt Enable
#define FWIE                          0x00000200      // FIFO Warning Interrupt Enable
#define FRIE                          0x00000100      // FIFO Request Interrupt Enable
#define FWDE                          0x00000002      // FIFO Warning DMA Enable
#define FRDE                          0x00000001      // FIFO Request DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR1 register.
//
//*****************************************************************************

#define RFW                           0x00000001      // Receive FIFO Watermark


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR2 register.
//
//*****************************************************************************

#define SYNC                          0x180000000      // Synchronous Mode
#define BCS                           0x20000000      // Bit Clock Swap
#define BCI                           0x10000000      // Bit Clock Input
#define MSEL                          0x18000000      // MCLK Select
#define BCP                           0x02000000      // Bit Clock Polarity
#define BCD                           0x01000000      // Bit Clock Direction
#define DIV                           0x00007F80      // Bit Clock Divide


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR3 register.
//
//*****************************************************************************

#define CFR                           0x06000000      // Channel FIFO Reset
#define RCE                           0x00060000      // Receive Channel Enable
#define WDFL                          0x00000001      // Word Flag Configuration


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR4 register.
//
//*****************************************************************************

#define FCONT                         0x10000000      // FIFO Continue on Error
#define FCOMB                         0x18000000      // FIFO Combine Mode
#define FPACK                         0x06000000      // FIFO Packing Mode
#define FRSZ                          0x01F00000      // Frame size
#define SYWD                          0x0001F000      // Sync Width
#define MF                            0x00000010      // MSB First
#define FSE                           0x00000008      // Frame Sync Early
#define ONDEM                         0x00000004      // On Demand Mode
#define FSP                           0x00000002      // Frame Sync Polarity
#define FSD                           0x00000001      // Frame Sync Direction


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RCR5 register.
//
//*****************************************************************************

#define WNW                           0x1F0000000      // Word N Width
#define W0W                           0x01F00000      // Word 0 Width
#define FBT                           0x0001F000      // First Bit Shifted


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RDRn register.
//
//*****************************************************************************

#define RDR                           0x00000001      // Receive Data Register



//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RFRn register.
//
//*****************************************************************************

#define WCP                           0x80000000      // Write Channel Pointer
#define WFP                           0x00780000      // Write FIFO Pointer
#define RCP                           0x00008000      // Receive Channel Pointer
#define RFP                           0x00000001      // Read FIFO Pointer





//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RMR register.
//
//*****************************************************************************

#define RWM                           0x00000001      // Receive Word Mask



//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MCR register.
//
//*****************************************************************************






//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_MDR register.
//
//*****************************************************************************





//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_BAUD register.
//
//*****************************************************************************

#define MAEN1                         0x80000000      // Match Address Mode Enable 1
#define MAEN2                         0x40000000      // Match Address Mode Enable 2
#define M10                           0x20000000      // 10-bit Mode select
#define OSR                           0x1F0000000      // Over Sampling Ratio
#define TDMAE                         0x00800000      // Transmitter DMA Enable
#define RDMAE                         0x00200000      // Receiver Full DMA Enable
#define MATCFG                        0x00180000      // Match Configuration
#define BOTHEDGE                      0x00020000      // Both Edge Sampling
#define RESYNCDIS                     0x00010000      // Resynchronization Disable
#define LBKDIE                        0x00008000      // LIN Break Detect Interrupt Enable
#define RXEDGIE                       0x00004000      // RX Input Active Edge Interrupt Enable
#define SBNS                          0x00002000      // Stop Bit Number Select
#define SBR                           0x01FFF000      // Baud Rate Modulo Divisor


//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_STAT register.
//
//*****************************************************************************

#define LBKDIF                        0x80000000      // LIN Break Detect Interrupt Flag
#define RXEDGIF                       0x40000000      // LPUART_RX Pin Active Edge Interrupt Flag
#define MSBF                          0x20000000      // MSB First
#define RXINV                         0x10000000      // Receive Data Inversion
#define RWUID                         0x08000000      // Receive Wake Up Idle Detect
#define BRK13                         0x04000000      // Break Character Generation Length
#define LBKDE                         0x02000000      // LIN Break Detection Enable
#define RAF                           0x01000000      // Receiver Active Flag
#define TDRE                          0x00800000      // Transmit Data Register Empty Flag
#define TC                            0x00400000      // Transmission Complete Flag
#define RDRF                          0x00200000      // Receive Data Register Full Flag
#define IDLE                          0x00100000      // Idle Line Flag
#define OR                            0x00080000      // Receiver Overrun Flag
#define NF                            0x00040000      // Noise Flag
#define FE                            0x00020000      // Framing Error Flag
#define PF                            0x00010000      // Parity Error Flag
#define MA1F                          0x00008000      // Match 1 Flag
#define MA2F                          0x00004000      // Match 2 Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_CTRL register.
//
//*****************************************************************************

#define R8T9                          0x80000000      // Receive Bit 8 / Transmit Bit 9
#define R9T8                          0x40000000      // Receive Bit 9 / Transmit Bit 8
#define TXDIR                         0x20000000      // LPUART_TX Pin Direction in Single-Wire Mode
#define TXINV                         0x10000000      // Transmit Data Inversion
#define ORIE                          0x08000000      // Overrun Interrupt Enable
#define NEIE                          0x04000000      // Noise Error Interrupt Enable
#define FEIE                          0x02000000      // Framing Error Interrupt Enable
#define PEIE                          0x01000000      // Parity Error Interrupt Enable
#define TIE                           0x00800000      // Transmit Interrupt Enable
#define TCIE                          0x00400000      // Transmission Complete Interrupt Enable for
#define RIE                           0x00200000      // Receiver Interrupt Enable
#define ILIE                          0x00100000      // Idle Line Interrupt Enable
#define TE                            0x00080000      // Transmitter Enable
#define RE                            0x00040000      // Receiver Enable
#define RWU                           0x00020000      // Receiver Wakeup Control
#define SBK                           0x00010000      // Send Break
#define MA1IE                         0x00008000      // Match 1 Interrupt Enable
#define MA2IE                         0x00004000      // Match 2 Interrupt Enable
#define IDLECFG                       0x00001C00      // Idle Configuration
#define LOOPS                         0x00000080      // Loop Mode Select
#define DOZEEN                        0x00000040      // Doze Enable
#define RSRC                          0x00000020      // Receiver Source Select
#define M                             0x00000010      // 9-Bit or 8-Bit Mode Select
#define WAKE                          0x00000008      // Receiver Wakeup Method Select
#define ILT                           0x00000004      // Idle Line Type Select
#define PE                            0x00000002      // Parity Enable
#define PT                            0x00000001      // Parity Type


//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_DATA register.
//
//*****************************************************************************

#define                               0x7FFF80000000      // This field is reserved
#define NOISY                         0x00008000      // The current received dataword contained in DATA[R9:R0] was received with noise
#define PARITYE                       0x00004000      // The current received dataword contained in DATA[R9:R0] was received with a parity error
#define FRETSC                        0x00002000      // Frame Error / Transmit Special Character
#define RXEMPT                        0x00001000      // Receive Buffer Empty
#define IDLINE                        0x00000800      // Idle Line
#define R9T9                          0x00000200      // Read receive data buffer 9 or write transmit data buffer 9
#define R8T8                          0x00000100      // Read receive data buffer 8 or write transmit data buffer 8
#define R7T7                          0x00000080      // Read receive data buffer 7 or write transmit data buffer 7
#define R6T6                          0x00000040      // Read receive data buffer 6 or write transmit data buffer 6
#define R5T5                          0x00000020      // Read receive data buffer 5 or write transmit data buffer 5
#define R4T4                          0x00000010      // Read receive data buffer 4 or write transmit data buffer 4
#define R3T3                          0x00000008      // Read receive data buffer 3 or write transmit data buffer 3
#define R2T2                          0x00000004      // Read receive data buffer 2 or write transmit data buffer 2
#define R1T1                          0x00000002      // Read receive data buffer 1 or write transmit data buffer 1
#define R0T0                          0x00000001      // Read receive data buffer 0 or write transmit data buffer 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_MATCH register.
//
//*****************************************************************************

#define                               0x1F80000000      // This field is reserved
#define MA2                           0x7FE000000      // Match Address 2
#define                               0x001F8000      // This field is reserved
#define MA1                           0x0007FE00      // Match Address 1


//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_MODIR register.
//
//*****************************************************************************

