MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0CAC18R/mcu.h
#define                               0x380000000      // This field is reserved
#define IREN                          0x10000000      // IrDA Enable
#define TNP                           0x08000000      // Transmit Narrow Pulse
#define                               0x0C000000      // This field is reserved
#define TXCTSSRC                      0x01000000      // Transmit CTS Source
#define TXCTSC                        0x00800000      // Transmit CTS Control
#define RXRTSE                        0x00400000      // Receive RTS Enable
#define TXRTSPOL                      0x00200000      // Transmit RTS Polarity
#define TXRTSE                        0x00100000      // Transmit RTS Enable
#define TXCTSE                        0x00080000      // Transmit CTS Enable ::


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_DATA register.
//
//*****************************************************************************

#define TSICH                         0x780000000      // These bits specify current channel to be measured. In hardware trigger mode (TSI_GENCS[STM] = 1), the scan will not start until the hardware trigger occurs. In software trigger mode (TSI_GENCS[STM] = 0), the scan starts immediately when TSI_DATA[SWTS] bit is written by 1.
#define DMAEN                         0x00800000      // This bit is used together with the TSI interrupt enable bits(TSIIE, ESOR) to generate a DMA transfer request instead of an interrupt.
#define SWTS                          0x00400000      // This write-only bit is a software start trigger. When STM bit is clear, write "1" to this bit will start a scan. The electrode channel to be scanned is determinated by TSI_DATA[TSICH] bits.
#define TSICNT                        0x7FFF8000      // TSI Conversion Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TSIx_TSHD register.
//
//*****************************************************************************

#define THRESH                        0x7FFF80000000      // TSI Wakeup Channel High-threshold
#define THRESL                        0x7FFF8000      // TSI Wakeup Channel Low-threshold



#endif // __MK26FN2M0CAC18R_H__

